vimilla-emacs.org
#+title: Minimalistic Vim Flavoured Emacs Config
#+PROPERTY: header-args :tangle init.el :results silent :lexical t

* lexical
#+begin_src elisp
;;; -*- lexical-binding: t; -*-
#+end_src

* check if use-package exists
Otherwise we do some hacky thing to make the rest of the config somewhat work
#+begin_src elisp
  (unless (boundp 'package-archives)
    (package-initialize))
#+end_src

#+begin_src elisp
  (require 'cl-lib)
  (unless (fboundp 'use-package)
    (defmacro use-package (&rest body)
      "Very hacky macro to wrap each statement in a"
      `(progn 
      ,@(cl-map 'list
              (lambda (stmt)
                (message "%s" stmt)
                `(ignore-errors ,stmt)
                )
              body
        )
      )
    )
    )
#+end_src

* CANCELLED separate document for keybindings?
I do enjoy having everything in the one file though and a lot of this stuff is not /just/ setting keybinds,
its also doing a lot of elisp stuff that work /with/ the keybinds

* having my own minor mode for keymaps just for the M-<tab> to normal minibuffer optionally after icomplete
#+begin_src elisp
;; Main use is to have my key bindings have the highest priority
;; https://github.com/kaushalmodi/.emacs.d/blob/master/elisp/modi-mode.el

(defvar my-mode-map (make-sparse-keymap)
  "Keymap for `my-mode'.")

;;;###autoload
(define-minor-mode my-mode
  "A minor mode so that my key settings override annoying major modes."
  ;; If init-value is not set to t, this mode does not get enabled in
  ;; `fundamental-mode' buffers even after doing \"(global-my-mode 1)\".
  ;; More info: http://emacs.stackexchange.com/q/16693/115
  :init-value t
  :lighter " my-mode"
  :keymap my-mode-map)

;;;###autoload
(define-globalized-minor-mode global-my-mode my-mode my-mode)

;; https://github.com/jwiegley/use-package/blob/master/bind-key.el
;; The keymaps in `emulation-mode-map-alists' take precedence over
;; `minor-mode-map-alist'
(add-to-list 'emulation-mode-map-alists `((my-mode . ,my-mode-map)))

;; Turn off the minor mode in the minibuffer
(defun turn-off-my-mode ()
  "Turn off my-mode."
  (my-mode -1))
#+end_src

* WIP other git commands that VC doesn't handle like git rebase and stuff
something like this

mainly for these two:
git fetch
git rebase

and need to figure out keymappings

just a simple wrapper in the case where we can't install magit
#+begin_src elisp
  (defun my/vc-git-editor-command (command)
    "command is a git subcommand that requires an editor.
   example usage: (my/vc-git-editor-command \"rebase -i HEAD~3\")"
    (interactive "P")
    (unless server-mode (server-force-delete) (server-mode))
    (let ((command (if command command (read-string "command: git "))))
      (compile (concat "GIT_EDITOR=\"emacsclient\" bash -c \"git " command "\""))))

  (defun my/vc-git-rebase-i (&optional branch)
    "if branch isn't supplied from arg, prompt for it"
    (interactive)
    (let ((revision (if branch branch (read-string "revision: "))))
      (my/vc-git-editor-command (concat "rebase -i " revision))))

  (defun my/vc-git-rebase-abort ()
    (interactive)
    (compile "git rebase --abort"))

  (defun my/vc-git-rebase-continue ()                  
    (interactive)                                 
    (compile "git rebase --continue"))

  (defun my/vc-git-fetch ()                  
    (interactive)                                  
    (compile "git fetch -v"))

  (defun my/vc-get-remote ()
    (let* ((remote-names (split-string (shell-command-to-string "git remote")))
           (remote-urls
            (mapcar (lambda (r)
                      (cons r 
                            (string-trim
                             (shell-command-to-string (concat "git remote get-url " r)))))
                    remote-names))
           (annotation-fn (lambda (candidate) (cdr (assoc candidate remote-urls))))
           (completion-extra-properties `(:annotation-function ,annotation-fn))
           (remote (completing-read "Remote: " remote-urls)))
      remote))

  (defun my/vc-set-remote-url ()
    (interactive)
    (let* ((remote (my/vc-get-remote))
           (curr-url (string-trim
                      (shell-command-to-string (concat "git remote get-url " remote))))

           (new-url (minibuffer-with-setup-hook (lambda () (insert curr-url))
                      (read-string (concat "Set url for remote <" remote ">: ")))))
      (compile (concat "git remote set-url " remote " " new-url))))

  (defun my/vc-set-branch-upstream ()
    (interactive)
    (let* ((remote (my/vc-get-remote))
           (curr-branch (car (vc-git-branches)))
           (upstream (minibuffer-with-setup-hook
                         (lambda () (insert remote "/" curr-branch))
                       (read-string (concat "set branch <" curr-branch "> upstream to: ")))))
      (compile (concat "git branch -u " upstream))))

  (defun my/vc-add-remote ())
  (defun my/vc-delete-remote ())
  (defun my/vc-set-remote-url ())
#+end_src

** git diff for .. or ...
#+begin_src elisp

  (defun vc-git-common-ancestor-diff (files &optional rev1 rev2 buffer _async)
    "Get a difference report using Git between two revisions of FILES."
    (let (process-file-side-effects
          (command "diff"))
      (vc-git--asciify-coding-system)
      (if rev2
          ;; Diffing against the empty tree.
          (unless rev1 (setq rev1 "4b825dc642cb6eb9a060e54bf8d69288fbee4904"))
        (setq command "diff-index")
        (unless rev1 (setq rev1 "HEAD")))
      (if vc-git-diff-switches
          (apply #'vc-git-command (or buffer "*vc-diff*")
             1 ; bug#21969
                 files
                 command
                 "--exit-code"
                 (append (vc-switches 'git 'diff)
                         (list "-p" (concat (or rev1 "HEAD") "..." rev2) "--")))
        (vc-git-command (or buffer "*vc-diff*") 1 files
                        "difftool" "--exit-code" "--no-prompt" "-x"
                        (concat "diff "
                                (mapconcat #'identity
                                           (vc-switches nil 'diff) " "))
                        (concat rev1 "..." rev2) "--"))))

  (defun vc-git-diff-advice (orig-fun &rest args)
    (if (and (eq this-command #'vc-root-version-diff) (not current-prefix-arg))
        (apply #'vc-git-common-ancestor-diff args)
      (apply orig-fun args))
    )
  (advice-add #'vc-git-diff :around #'vc-git-diff-advice)
#+end_src

* convenient alias
org really hates the parens matching when < or > is involved
#+begin_src elisp
  (defalias 'gt #'>)
  (defalias 'gt= #'>=)
  (defalias 'lt #'<)
  (defalias 'lt= #'<=)
  (defun neq (obj1 obj2)
    "Convenience for not 'eq'"
    (not (eq obj1 obj2)))

#+end_src

* ediff-setup
#+begin_src elisp
  (use-package ediff :defer t
    :config
    (advice-remove 'ediff-quit #'disable-y-or-n-p)
    (defun disable-y-or-n-p (orig-fun &rest args)
      (cl-letf (((symbol-function 'y-or-n-p) (lambda (prompt) t)))
        (apply orig-fun args)))
    (advice-add 'ediff-quit :around #'disable-y-or-n-p)

    (setq ediff-keep-variants nil)
    (setq ediff-window-setup-function #'ediff-setup-windows-plain)
    (setq ediff-split-window-function #'split-window-horizontally))
#+end_src

#+begin_src elisp
  (defun vc-ediff-file-at-point ()
    (interactive)
    (when (eq major-mode 'diff-mode)
      (setq my-ediff-prior-window-configuration (current-window-configuration))
      (let ((old-revision (first diff-vc-revisions))
            (new-revision (second diff-vc-revisions))
            (file-to-diff (save-window-excursion
                            (diff-goto-source)
                            (buffer-file-name))))
        (vc-version-ediff `(,file-to-diff) old-revision new-revision))))

  (add-hook 'ediff-quit-hook
            (lambda () (when (window-configuration-p my-ediff-prior-window-configuration)
                         (set-window-configuration my-ediff-prior-window-configuration)))
            100)
#+end_src

* linux settings
#+begin_src elisp
  (when (eq system-type 'gnu/linux)
    (setq x-super-keysym 'meta)
    (setq x-meta-keysym 'super))
#+end_src

* Mac settings
if machine isn't a mac then this won't do anything anyways so need to do some OS version check or whatever

Also keybinds for super key
see the emacs wiki page for how this works:
https://www.emacswiki.org/emacs/iTerm2

Basically go to iterm settings -> keys -> + button to add a keybind
make a keybind for cmd-/ and set it to send an escape sequence for [1;P9
then map that [1;P9 to whatever we want.

The P9 can go to like P56. [1;P9 maps to like CTRL CMD OPTION A, which we probably aren't gonna use lol so it's safe to map that to something more useful
#+begin_src elisp
  (setq mac-option-modifier 'meta)
  (setq mac-command-modifier 'super)
  (define-key global-map (kbd "s-/") #'comment-line)

  ;; terminal stuff, C-/ in case we don't have iterm config
  (define-key global-map (kbd "C-/") #'comment-line)
  (define-key global-map (kbd "C-_") #'comment-line)
  (define-key input-decode-map "\e[1;P9" (kbd "s-/"))

  ;; mac ligatures
  (when (fboundp 'mac-auto-operator-composition-mode)
    (mac-auto-operator-composition-mode))
#+end_src

