init.el
;;; -*- lexical-binding: t; -*-

(unless (boundp 'package-archives)
  (package-initialize))

(require 'cl-lib)
(unless (fboundp 'use-package)
  (defmacro use-package (&rest body)
    "Very hacky macro to wrap each statement in a"
    `(progn 
    ,@(cl-map 'list
            (lambda (stmt)
              (message "%s" stmt)
              `(ignore-errors ,stmt)
              )
            body
      )
    )
  )
  )

(defun my/vc-git-editor-command (command)
  "command is a git subcommand that requires an editor.
 example usage: (my/vc-git-editor-command \"rebase -i HEAD~3\")"
  (interactive "P")
  (unless server-mode (server-force-delete) (server-mode))
  (let ((command (if command command (read-string "command: git "))))
    (compile (concat "GIT_EDITOR=\"emacsclient\" bash -c \"git " command "\""))))

(defun my/vc-git-rebase-i (&optional branch)
  "if branch isn't supplied from arg, prompt for it"
  (interactive)
  (let ((revision (if branch branch (read-string "revision: "))))
    (my/vc-git-editor-command (concat "rebase -i " revision))))

(defun my/vc-git-rebase-abort ()
  (interactive)
  (compile "git rebase --abort"))

(defun my/vc-git-rebase-continue ()                  
  (interactive)                                 
  (compile "git rebase --continue"))

(defun my/vc-git-fetch ()                  
  (interactive)                                  
  (compile "git fetch -v"))

(defun my/vc-get-remote ()
  (let* ((remote-names (split-string (shell-command-to-string "git remote")))
         (remote-urls
          (mapcar (lambda (r)
                    (cons r 
                          (string-trim
                           (shell-command-to-string (concat "git remote get-url " r)))))
                  remote-names))
         (annotation-fn (lambda (candidate) (cdr (assoc candidate remote-urls))))
         (completion-extra-properties `(:annotation-function ,annotation-fn))
         (remote (completing-read "Remote: " remote-urls)))
    remote))

(defun my/vc-set-remote-url ()
  (interactive)
  (let* ((remote (my/vc-get-remote))
         (curr-url (string-trim
                    (shell-command-to-string (concat "git remote get-url " remote))))

         (new-url (minibuffer-with-setup-hook (lambda () (insert curr-url))
                    (read-string (concat "Set url for remote <" remote ">: ")))))
    (compile (concat "git remote set-url " remote " " new-url))))

(defun my/vc-set-branch-upstream ()
  (interactive)
  (let* ((remote (my/vc-get-remote))
         (curr-branch (car (vc-git-branches)))
         (upstream (minibuffer-with-setup-hook
                       (lambda () (insert remote "/" curr-branch))
                     (read-string (concat "set branch <" curr-branch "> upstream to: ")))))
    (compile (concat "git branch -u " upstream))))

(defun my/vc-add-remote ())
(defun my/vc-delete-remote ())
(defun my/vc-set-remote-url ())

(defun vc-git-common-ancestor-diff (files &optional rev1 rev2 buffer _async)
  "Get a difference report using Git between two revisions of FILES."
  (let (process-file-side-effects
        (command "diff"))
    (vc-git--asciify-coding-system)
    (if rev2
        ;; Diffing against the empty tree.
        (unless rev1 (setq rev1 "4b825dc642cb6eb9a060e54bf8d69288fbee4904"))
      (setq command "diff-index")
      (unless rev1 (setq rev1 "HEAD")))
    (if vc-git-diff-switches
        (apply #'vc-git-command (or buffer "*vc-diff*")
           1 ; bug#21969
               files
               command
               "--exit-code"
               (append (vc-switches 'git 'diff)
                       (list "-p" (concat (or rev1 "HEAD") "..." rev2) "--")))
      (vc-git-command (or buffer "*vc-diff*") 1 files
                      "difftool" "--exit-code" "--no-prompt" "-x"
                      (concat "diff "
                              (mapconcat #'identity
                                         (vc-switches nil 'diff) " "))
                      (concat rev1 "..." rev2) "--"))))

(defun vc-git-diff-advice (orig-fun &rest args)
  (if (and (eq this-command #'vc-root-version-diff) (not current-prefix-arg))
      (apply #'vc-git-common-ancestor-diff args)
    (apply orig-fun args))
  )
(advice-add #'vc-git-diff :around #'vc-git-diff-advice)

(defalias 'gt #'>)
(defalias 'gt= #'>=)
(defalias 'lt #'<)
(defalias 'lt= #'<=)
(defun neq (obj1 obj2)
  "Convenience for not 'eq'"
  (not (eq obj1 obj2)))

(use-package ediff :defer t
  :config
  (advice-remove 'ediff-quit #'disable-y-or-n-p)
  (defun disable-y-or-n-p (orig-fun &rest args)
    (cl-letf (((symbol-function 'y-or-n-p) (lambda (prompt) t)))
      (apply orig-fun args)))
  (advice-add 'ediff-quit :around #'disable-y-or-n-p)

  (setq ediff-keep-variants nil)
  (setq ediff-window-setup-function #'ediff-setup-windows-plain)
  (setq ediff-split-window-function #'split-window-horizontally))

(defun vc-ediff-file-at-point ()
  (interactive)
  (when (eq major-mode 'diff-mode)
    (setq my-ediff-prior-window-configuration (current-window-configuration))
    (let ((old-revision (first diff-vc-revisions))
          (new-revision (second diff-vc-revisions))
          (file-to-diff (save-window-excursion
                          (diff-goto-source)
                          (buffer-file-name))))
      (vc-version-ediff `(,file-to-diff) old-revision new-revision))))

(add-hook 'ediff-quit-hook
          (lambda () (when (window-configuration-p my-ediff-prior-window-configuration)
                       (set-window-configuration my-ediff-prior-window-configuration)))
          100)

(when (eq system-type 'gnu/linux)
  (setq x-super-keysym 'meta)
  (setq x-meta-keysym 'super))

(setq mac-option-modifier 'meta)
(setq mac-command-modifier 'super)
(define-key global-map (kbd "s-/") #'comment-line)

;; terminal stuff, C-/ in case we don't have iterm config
(define-key global-map (kbd "C-/") #'comment-line)
(define-key global-map (kbd "C-_") #'comment-line)
(define-key input-decode-map "\e[1;P9" (kbd "s-/"))

;; mac ligatures
(when (fboundp 'mac-auto-operator-composition-mode)
  (mac-auto-operator-composition-mode))
