vimilla-emacs.org
* terminal settings
#+begin_src elisp
  (defun macos-term-select-text-to-clipboard (text)
    (unless (eq system-type 'gnu/linux)
      (shell-command (concat "echo \"" text "\" | pbcopy" ))))

  ;; ITERM2 MOUSE SUPPORT
  (unless (or window-system (daemonp))
    (require 'mouse)
    (xterm-mouse-mode t)
    (defun track-mouse (e)) 
    (setq mouse-sel-mode t)
    (setq interprogram-cut-function #'macos-term-select-text-to-clipboard)) ;; good enough
#+end_src

* Window commands
:PROPERTIES:
:VISIBILITY: folded
:END:
not necessary viper, but same idea
need to set the window map before viper loads cause we use it in the motion keymap
#+begin_src elisp
  (winner-mode)

  (defun my/set-transparency-in-terminal ()
    (interactive)
    (unless (string= (face-background 'default) "unspecified-bg")
      (setq prev-default-face-bg (face-background 'default)))
    (unless (display-graphic-p (selected-frame))
      (set-face-background 'default "unspecified-bg" (selected-frame))))

  (defun my/unset-transparency-in-terminal ()
    (interactive)
    (unless (display-graphic-p (selected-frame))
      (set-face-background 'default prev-default-face-bg (selected-frame))))

  (defun my/set-frame-alpha (&optional arg)
    (interactive "sFrame Alpha? ")
    (if
        (and arg (not (string-empty-p arg)))
        (set-frame-parameter nil 'alpha  (string-to-number arg))
      (set-frame-parameter nil 'alpha 90)))

  (defun my/set-frame-alpha-background (&optional arg)
    (interactive "sFrame Alpha Background? ")
    (if
        (and arg (not (string-empty-p arg)))
        (set-frame-parameter nil 'alpha-background  (string-to-number arg))
      (set-frame-parameter nil 'alpha-background 90)))
  (set-frame-parameter nil 'alpha-background 85)

  (setq my-window-map (make-sparse-keymap))

  (define-key my-window-map "u" #'winner-undo)
  (define-key my-window-map "r" #'winner-redo)

  (define-key my-window-map "<"
              (lambda (arg) (interactive "P") (shrink-window-horizontally (if arg arg 1))))
  (define-key my-window-map ">"
              (lambda (arg) (interactive "P") (enlarge-window-horizontally (if arg arg 1))))

  (define-key my-window-map "-"
              (lambda (arg) (interactive "P") (shrink-window (if arg arg 1))))
  (define-key my-window-map "+"
              (lambda (arg) (interactive "P") (enlarge-window (if arg arg 1))))

  (define-key my-window-map "v" #'split-window-horizontally)
  (define-key my-window-map "s" #'split-window-vertically)

  (define-key my-window-map "q" #'delete-window)
  (define-key my-window-map "\C-w" #'other-window)

  (define-key my-window-map "l" #'windmove-right)
  (define-key my-window-map "\C-l" #'windmove-right)

  (define-key my-window-map "h" #'windmove-left)
  (define-key my-window-map "\C-h" #'windmove-left)

  (define-key my-window-map "k" #'windmove-up)
  (define-key my-window-map "\C-k" #'windmove-up)

  (define-key my-window-map "j" #'windmove-down)
  (define-key my-window-map "\C-j" #'windmove-down)

  (define-key my-window-map "=" #'balance-windows)

  (define-key my-window-map "o" #'maximize-window)
  (define-key my-window-map "\C-o" #'delete-other-windows)

  (define-key global-map (kbd "\C-w") nil)
  (define-key global-map (kbd "\C-w") my-window-map)
#+end_src

* misc startup tasks
viper mode, global hl and visual lines
stole the completing read stuff from:
#+begin_src elisp

  (setq gc-cons-threshold most-positive-fixnum)

  ;; Lower threshold back to 8 MiB (default is 800kB)
  (add-hook 'emacs-startup-hook
            (lambda () (setq gc-cons-threshold (* 1024 1024 16)))) ;; 16MB

  (run-with-idle-timer 2 t #'garbage-collect)

  (setq inhibit-startup-screen t)

  (use-package menu-bar :defer t :config (menu-bar-mode 0))
  (use-package tool-bar :defer t :config (tool-bar-mode 0))

  (setq viper-mode t)
  (require 'viper)
  (require 'rect)

  (use-package scroll-bar :defer t)
  (viper-mode)
  (global-hl-line-mode)
  (global-auto-revert-mode)
  (setq auto-revert-verbose nil)
  (global-visual-line-mode)
  (when (fboundp #'global-visual-wrap-prefix-mode)
    (global-visual-wrap-prefix-mode)
    (setq visual-wrap-extra-indent 4))

  (when (fboundp #'kill-ring-deindent-mode)
    (kill-ring-deindent-mode))

  (add-hook 'prog-mode-hook (lambda () (modify-syntax-entry ?_ "-") (modify-syntax-entry ?_ "_")))

  (setq revert-without-query '(".*")) ;; allow reverting without confirm
  (setq column-number-mode t)
  (setq scroll-margin 8)
  (setq visual-bell t)
  (setq ring-bell-function 'ignore)
  (setq scroll-preserve-screen-position t)
  (setq eval-expression-print-level nil)
  (setq eval-expression-print-length nil)
#+end_src

** steal doom's auto save transform
#+begin_src elisp
  (ignore-errors
    (make-directory (concat (file-name-directory user-init-file) ".local/"))
    (make-directory (concat (file-name-directory user-init-file) ".local/autosave/"))
    (make-directory (concat (file-name-directory user-init-file) ".local/backups/")))

  (setq auto-save-file-name-transforms 
        `(("\\`/[^/]*:\\([^/]*/\\)*\\([^/]*\\)\\'" "/Users/jason.z/.emacs.d/.local/cache/autosave/tramp-\\2" t)
          (".*" ,(concat (file-name-directory user-init-file) ".local/autosave/\\1") t)))
  (setq back-directory-alist `((".*" ,(concat (file-name-directory user-init-file) ".local/backups/"))))

#+end_src

** yank from kill ring keybind
#+begin_src elisp
  (define-key global-map (kbd "C-S-p") #'yank-from-kill-ring)
#+end_src

* auto save buffers
#+begin_src elisp
  (setq auto-save-visited-interval 7)
  (auto-save-visited-mode)
#+end_src

* better backup file behavior
#+begin_srC elisp
  (setq backup-directory-alist `(("." . "~/.emacs.d/save-backups")))
  (setq backup-by-copying t)
  (setq delete-old-versions t
        kept-new-versions 6
        kept-old-versions 2
        version-control t)
#+end_srC 

