init.el

(use-package savehist
  :init
  (savehist-mode))

(setq completions-sort nil) ;; faster

(define-key minibuffer-local-completion-map "\t" #'icomplete-force-complete)
(define-key minibuffer-local-completion-map (kbd "C-<return>") #'viper-exit-minibuffer)
(define-key global-map (kbd "C-z") #'viper-mode) ;; C-z to suspend frame is annoying with viper

(setq completion-styles '(partial-completion basic) completion-category-overrides nil completion-category-defaults nil)
;; need this hook otherwise i think fido setup or something overrides the completion which is annoying
(defun my-icomplete-styles () (setq-local completion-styles '(partial-completion basic)))
(add-hook 'icomplete-minibuffer-setup-hook 'my-icomplete-styles)

(defvar my-icomplete-prev-command nil)
(defun my-icomplete-save ()
  "save the prvious icomplete session"
  (setq my-icomplete-prev-command this-command)
  (add-hook 'post-command-hook #'my-icomplete-exit-save-input nil 'local))

(defvar my-icomplete-prev-input "")
(defun my-icomplete-exit-save-input ()
  (setq my-icomplete-prev-input (minibuffer-contents-no-properties)))

(add-hook 'icomplete-minibuffer-setup-hook 'my-icomplete-save)

(defun my-icomplete-repeat ()
  (interactive)
  (when (and (not (equal my-icomplete-prev-command #'my-icomplete-repeat))
             (commandp my-icomplete-prev-command))
    (minibuffer-with-setup-hook
        (lambda () (insert my-icomplete-prev-input))
      (call-interactively my-icomplete-prev-command))))

(define-key my/leader-prefix-map "'" #'my-icomplete-repeat)

;; insert * at the beginning so we don't have to match exactly at the beginning
;; but only in the icomplete minibuffer so we don't clash with viper minibuffer and stuff
;; also not command category, cause it slows it down
(defun icomplete-partial-completion-setup ()
  (unless (or (eq (icomplete--category) 'file)
              (eq (icomplete--category) 'command))
    (insert "*")))
(add-hook 'icomplete-minibuffer-setup-hook #'icomplete-partial-completion-setup)

;; insert wild card to sorta emulate orderless
(defun icomplete-partial-completion-insert-wildcard ()
  (interactive)
  (unless (eq last-command 'viper-ex)
    (insert "*")))

(define-key icomplete-minibuffer-map " " #'icomplete-partial-completion-insert-wildcard)
;; this allows us to still insert spaces
(define-key icomplete-minibuffer-map (kbd "M-SPC") (lambda () (interactive) (insert " ")))

(add-hook 'minibuffer-setup-hook (lambda () (setq-local icomplete-show-matches-on-no-input nil)) 100)

(advice-add #'viper-search :after
            (lambda (string &rest args)
              (hi-lock-face-buffer string)))
