vimilla-emacs.org
** optional incremental occur, similar to swiper
[[*better escape handling][advice to turn off highlighting on escape]]
#+begin_src elisp
  ;; keep highlighting after isearch
  (setq lazy-highlight-cleanup nil)

  (defun my/ioccur-minibuf-after-edit (beg end len)
    (setq my/ioccur-string (buffer-substring-no-properties (1+ (length my/ioccur-prompt-string)) (point-max)))
    (when (gt (length (string-replace ".*" "" my/ioccur-string)) 2)
      (ignore-errors (occur-1 my/ioccur-string
                              my/ioccur-nlines-arg
                              (list my/occur-buffer)))))

  (setq my/ioccur-prompt-string "Find: ")
  (setq my/ioccur-string "")

  (defun my/ioccur (arg)
    "Run a pseudo interactive grep, which will incrementally update the xref buffer based on minibuffer input.
  With a prefix-arg run normally and specfiy a directory"
    (interactive "P")
    (setq my/ioccur-string "")
    (setq my/occur-buffer (current-buffer))
    (setq my/ioccur-nlines-arg (when arg (prefix-numeric-value arg)))
    (minibuffer-with-setup-hook
        (lambda ()
          (local-set-key (kbd "SPC") (lambda () (interactive) (insert ".*")))
          (add-hook 'after-change-functions #'my/ioccur-minibuf-after-edit nil 'local))
      (occur-1 (read-regexp my/ioccur-prompt-string)
               my/ioccur-nlines-arg
               (list my/occur-buffer))))

  (viper-map! :mode 'occur-mode
              :n "i" #'occur-edit-mode)

  (viper-map! :leader
              "ss" #'my/ioccur
              ;; not sure why but we need to rescan the imenu for our igrep xref buffer
              "si" (lambda () (interactive)
                     (imenu--menubar-select imenu--rescan-item)
                     (call-interactively 'imenu)))
#+end_src

* ripgrep wrapper
#+begin_src elisp
  (defun ripgrep ()
    (interactive)
    (call-interactively 'grep))

  (defun rripgrep ()
    (interactive)
    (call-interactively 'rgrep))

  (defun rripgrep-multiline ()
    (interactive)
    (call-interactively 'rgrep))

  (defun rgrep-multiline ()
    (interactive)
    (grep-apply-setting 'grep-command "grep -Pazo --color=auto -nH --null -e ")
    (call-interactively 'rgrep))

  (defun grep-options-advice ()
    "A convenient way for us to put different options depending on the grep command being run.
  See notes:emacs-notes-and-tips for more details."
    (cond ((or (eq this-command 'ripgrep) (eq this-command 'rripgrep))
           (progn
             (grep-apply-setting 'grep-command "rg -nS --no-heading ") ;; for normal single file grep
             (grep-apply-setting 'grep-find-template "find <D> <X> -type f <F> -exec rg <C> -nS --no-heading -H  <R> /dev/null {} +"))) ;; for rgrep; uses grep-find-template
          ((eq this-command 'rripgrep-multiline)
           (progn
             (grep-apply-setting 'grep-find-template "find <D> <X> -type f <F> -exec rg <C> -nSU --no-heading -H  <R> /dev/null {} +")))
          ((eq this-command 'rgrep-multiline)
           (progn
             (grep-apply-setting 'grep-find-template "find -H <D> <X> -type f <F> -exec grep -zo <C> -nH --null -e <R> \\{\\} +")))
          (t (progn ;; defaults in case I want to change them later to do something different, otherwise don't really need this last case
               (grep-apply-setting 'grep-find-template "find -H <D> <X> -type f <F> -exec grep <C> -nH --null -e <R> \\{\\} +")
               (grep-apply-setting 'grep-command "grep --color=auto -nH --null -e ")))
          )
    )

  (advice-add #'grep-compute-defaults :before #'grep-options-advice)
#+end_src

* completion

** default to dabbrev-capf
#+begin_src elisp
  (require 'dabbrev)
  ;; #'dabbrev-completion resets the global variables first so we do the same
  (advice-add #'dabbrev-capf :before #'dabbrev--reset-global-variables)
  (add-hook 'completion-at-point-functions #'dabbrev-capf 100)
#+end_src

** xref completion settings
advice for various search commands =project-find-regexp=, =xref-find-apropos=
nice quality of life similar to how we do partial completion
#+begin_src elisp
  (use-package xref
    :config
    (setq xref-search-program
          (cond ((executable-find "rg") 'ripgrep)
                ((executable-find "ugrep") 'ugrep)
                (t 'grep)))
    (setq xref-show-xrefs-function #'xref-show-definitions-completing-read)
    (setq xref-show-definitions-function #'xref-show-definitions-completing-read)

   
  (defun search-advice (orig-fun regexp)
    (let ((xref-show-xrefs-function #'xref--show-xref-buffer))
      (minibuffer-with-setup-hook
          (lambda ()
            ;; for some reason this doesn't apply in xref find apropos but that's honestly ok
            ;; cause it uses a space separated list of words anyways
            (local-set-key (kbd "M-SPC") (lambda () (interactive) (insert " ")))
            (local-set-key (kbd "SPC") (lambda () (interactive) (insert ".*"))))
        (funcall orig-fun regexp))))
  (advice-add 'project-find-regexp :around #'search-advice)
  (advice-add 'xref-find-apropos :around #'search-advice)
  (advice-add 'previous-history-element :after #'end-of-line) ;; usually we want to go to end of line



    (setq my/xref-vi-state-modify-map
          (make-composed-keymap
           nil
           (make-composed-keymap
            (list my/viper-vi-basic-motion-keymap
                  my/viper-vi-motion-g-keymap
                  my/viper-vi-motion-leader-keymap)
            xref--xref-buffer-mode-map)))
    (viper-modify-major-mode 'xref--xref-buffer-mode 'vi-state my/xref-vi-state-modify-map))
#+end_src

** in buffer completion
from:
https://www.reddit.com/r/emacs/comments/zl6amy/completionatpoint_using_completingread_icomplete/

Ctrl-J to force completion and exit

This is mostly just a simpler version of consult and only concerned with completion at point basically
https://www.gnu.org/software/emacs/manual/html_node/elisp/Programmed-Completion.html
https://www.gnu.org/software/emacs/manual/html_node/elisp/Programmed-Completion.html

bunch of stuff here to basically call the function version of /collection/ inside the current buffer
no idea how necessary that is
#+begin_src elisp
  (setq enable-recursive-minibuffers t)
  (setq icomplete-in-buffer t)
  (setq minibuffer-visible-completions t)
  (when (fboundp 'global-completion-preview-mode) (global-completion-preview-mode))

  ;; for default completion behavior in the *completions* buffer, should we decide to use it
  (define-key completion-in-region-mode-map (kbd "C-n") #'minibuffer-next-completion)
  (define-key completion-in-region-mode-map (kbd "C-p") #'minibuffer-previous-completion)
  (when (boundp 'minibuffer-visible-completions-map)
    (define-key minibuffer-visible-completions-map (kbd "C-n") #'minibuffer-next-completion)
    (define-key minibuffer-visible-completions-map (kbd "C-p") #'minibuffer-previous-completion))
  (setq completions-format 'one-column)
  (setq completions-max-height 20)
  (setq completions-header-format nil)

  (define-error 'no-completions "completing-read-in-region: No completions")
  (defun completing-read-in-region (start end collection &optional predicate)
    "Prompt for completion of region in the minibuffer if non-unique.
    Use as a value for `completion-in-region-function'."
    (let* ((initial (buffer-substring-no-properties start end))
           (limit (car (completion-boundaries initial collection predicate "")))
           (all (completion-all-completions initial collection predicate (length initial)))
           ;; when the completion candidate list a single one, for some reason completing-read
           ;; will delete a bunch of lines.
           ;; to couteract this, we basically undo an atomic change and set the completion variable
           (completion (cond
                        ((atom all) nil)
                        ((and (consp all) (atom (cdr all)))
                         (concat (substring initial 0 limit) (car all)))
                        (t
                         (setq completion 
                               (catch 'done
                                 (atomic-change-group 
                                   (let ((completion
                                          (completing-read "Completion: " collection predicate nil initial)))
                                     (throw 'done completion)))))))))
      (cond (completion (completion--replace start end completion) t)
            (t (signal 'no-completions nil)))))
  ;;(setq completion-in-region-function #'completing-read-in-region)
  (setq completion-in-region-function #'completion--in-region) ;; this is default


  ;; similar to doom's +corfu/move-to-minibuffer
  (define-key my-mode-map (kbd "M-<tab>")
              (lambda ()
                (interactive)
                (unwind-protect
                    (let ((completion-in-region-function
                           (if completion-in-region--data #'completing-read-in-region #'completion--in-region)))
                      (call-interactively #'complete-symbol))
                  )))

  (setq tab-always-indent 'complete)
#+end_src

