vimilla-emacs.org
*** better indent-for-tab-command and backtab behavior
#+begin_src elisp
  (defun indent-current-line ()
    "Indent the line. Stolen from the middle section of `indent-for-tab-command'."
    (or (not (eq (indent--funcall-widened indent-line-function) 'noindent))
        (indent--default-inside-comment)
        (when (or (lt= (current-column) (current-indentation))
                  (not (eq tab-always-indent 'complete)))
          (indent--funcall-widened (default-value 'indent-line-function)))))

  ;; want backtab to undo our indents basically but not do completion
  (defun indent-for-backtab-command ()
    "Want backtab to reindent the line if we've overintended with tab.
  Otheriwse, shift backwards by tab-width."
    (interactive)
    (if-let ((cmd (ignore-errors
                    (lookup-key (symbol-value (intern (concat (symbol-name major-mode) "-map")))
                                [backtab]))))
        (call-interactively cmd)
      (let ((text-before-pt (buffer-substring-no-properties (line-beginning-position) (point)))
            ;; get the would be indented column then undo the changes and restore point
            (indented-column (catch 'done (save-excursion
                                            (atomic-change-group
                                              (indent-current-line)
                                              (throw 'done (current-column)))))))

        ;; only deindent if we're equal to or before the would-be indented column
        ;; otherwise, go back to the intended indented position
        (if (lt= (current-column) indented-column)
            (indent-rigidly (if (region-active-p) (region-beginning) (line-beginning-position))
                            (if (region-active-p) (region-end) (line-end-position))
                            (- tab-width))
          (indent-current-line)))))

  (defun indent-for-tab-check-empty-before-point (orig-fun &rest args)
    "Around advice for `indent-for-tab-command'.
  Insert tabs DWIM style if the current position is already indented and
  we're at the beginning of the text on the current line.
  ORIG-FUN is `indent-for-tab-command' and ARGS is prefix-arg for that."
    (let ((text-before-pt (buffer-substring-no-properties (line-beginning-position) (point)))
          ;; get the would be indented column then undo the changes and restore point
          (indented-column (catch 'done (save-excursion
                                          (atomic-change-group
                                            (indent-current-line)
                                            (throw 'done (current-column)))))))
      ;; only indent if we're equal to or past the would-be indented column
      (if (and (gt= (current-column) indented-column)
               (string-blank-p text-before-pt))
          (insert-tab current-prefix-arg)
        (apply orig-fun args))))

  (advice-add 'indent-for-tab-command :around #'indent-for-tab-check-empty-before-point)
  (define-key viper-insert-basic-map [backtab] #'indent-for-backtab-command)
#+end_src

**** Unused
an alternative method that we won't be using in favor of the above
but this would insert a tab character upon 2 consecutive no-completion signals
#+begin_src elisp :tangle no
  (setq no-completion-count 0)

  (defun reset-no-completions-count ()
    (unless (eq this-command 'indent-for-tab-command)
      (setq no-completion-count 0)
      (remove-hook 'post-command-hook #'reset-no-completions-count) 
      )
    )
  (defun indent-for-tab-command-ad (orig-fun &rest args)
    (condition-case err
        (apply orig-fun args)
      (no-completions
       (setq no-completion-count (1+ no-completion-count))
       (add-hook 'post-command-hook #'reset-no-completions-count)
       (when (= no-completion-count 2)
         (insert-tab)
         (setq no-completion-count 0)
         )
       )
      )
    )

#+end_src

* vc settings
No need for the other backends
#+begin_src elisp
  (use-package vc :config
    (setq-default vc-handled-backends '(SVN Git Hg))
    (setq vc-git-diff-switches '("--histogram" "--diff-algorithm=histogram"))
    )
#+end_src

** diff stage hunk to separate buffer                                :WIP:
Want to follow more magit-like behavior
and adjust ~diff-hunk-kill~ to send the hunk to a separate
diff buffer that we can then commit

0. Assume using a unified context
   Otherwise, if we want the "context" diff, we can just use ediff instead
   Or convert after staging, or before to see it in context-mode, and changing back to unified.

1. Need to be able to add the file and junk to the new buffer
   maybe using ~diff-hunk-file-names~ or ~diff-beginning-of-file-and-junk~
2. Need to place the hunk under the correct file in the new buffer
   Can use a re-search-forward
3. Need to place the hunks in the correct order
   We can use the meta data in the header line of the hunk (starting with @@)
   to order things correctly
   
#+begin_src elisp
  ;; fallback to hunk based diff
  (setq diff-font-lock-syntax 'hunk-also)

  (defun diff-kill-hunk-a (og-fn &rest args)
    (let* ((stage-buf (get-buffer-create "*vc-stage-diff*"))
           (current-vc-revisions diff-vc-revisions)
           (beg-of-file-and-junk (save-excursion (diff-beginning-of-file-and-junk) (point)))
           (hunk-file-b (car (diff-hunk-file-names)))
           (hunk-file-a (cadr (diff-hunk-file-names)))
           (end-of-file-and-junk (save-excursion
                                   (diff-beginning-of-file-and-junk)
                                   (re-search-forward (concat "--- " hunk-file-a))
                                   (re-search-forward (concat "+++ " hunk-file-b))
                                   (point)))
           (file-and-junk (buffer-substring beg-of-file-and-junk (1+ end-of-file-and-junk)))
           (hunk-header-re (rx-to-string
                            `(: bol "@@ -" (group (1+ digit)) "," (1+ digit)
                                " +" (group (1+ digit)) "," (1+ digit) " @@")))
           (hunk-header (save-excursion
                          (re-search-backward hunk-header-re)
                          (buffer-substring-no-properties
                           (line-beginning-position)
                           (line-end-position))))
           (hunk-header-start (progn
                                (string-match hunk-header-re hunk-header)
                                (string-to-number
                                 (substring hunk-header (match-beginning 1) (match-end 1)))))
           (hunk-bounds (diff-bounds-of-hunk))
           (file-bounds (ignore-errors (diff-bounds-of-file)))
           ;; If the current hunk is the only one for its file, kill the
           ;; file header too.
           (hunk-and-file-killed (save-excursion
                                   (and file-bounds
                                        (progn (goto-char (car file-bounds))
                                               (= (progn (diff-hunk-next) (point))
                                                  (car hunk-bounds)))
                                        (progn (goto-char (cadr hunk-bounds))
                                               ;; bzr puts a newline after the last hunk.
                                               (while (looking-at "^\n")
                                                 (forward-char 1))
                                               (= (point) (cadr file-bounds))))))
           )
      ;;(message "killed hunk header start %s %s" hunk-header-start hunk-header)
      ;; kill-ring-deindent-mode can mess with whitespace in killed hunks
      ;; which can cause patches to not apply
      (if (and (boundp 'kill-ring-deindent-mode) kill-ring-deindent-mode)
          (progn
            (kill-ring-deindent-mode -1)
            (apply og-fn args)
            (kill-ring-deindent-mode))
        (apply og-fn args))
      (with-current-buffer stage-buf
        (display-buffer stage-buf)
        (diff-mode)

        (ignore-errors
          (setq-local diff-vc-backend (car (vc-deduce-fileset t)))
          (setq-local diff-vc-revisions current-vc-revisions))
        (diff-mode)

        ;; if the file-headers already exist don't do anything
        (let* ((found-file (condition-case nil
                               (save-excursion
                                 (goto-char (point-min))
                                 (re-search-forward (concat "--- " hunk-file-a))
                                 (re-search-forward (concat "+++ " hunk-file-b))
                                 t)
                             (error nil))))
          (message "found-file %s %s" found-file file-and-junk)
          (unless (or found-file hunk-and-file-killed)
            (goto-char (point-max))
            (insert file-and-junk))
          
          (goto-char (point-min))

          (message "wee %s %s %s" (point) hunk-file-a hunk-file-b )
          (condition-case nil
              (progn 
                (re-search-forward (concat "--- " hunk-file-a))
                (re-search-forward (concat "+++ " hunk-file-b))
                (message "wee %s %s %s" (point) hunk-file-a hunk-file-b )
                (forward-line)
                (beginning-of-line))
            (error (message "WTF %s %s" hunk-file-a hunk-file-b ))
            )
          

          ;; we should be in the right file in the stage buffer now
          (ignore-errors
            (let ((start-of-next-file
                   (save-excursion
                     (condition-case nil
                         (progn 
                           (re-search-forward diff-file-header-re)
                           (diff-beginning-of-file-and-junk)
                           (point)
                           )
                       ;; no next file
                       (error (point-max))
                       )
                     )
                   ))
              
              ;; insert the hunk at the correct position
              ;; using hunk headers eg: @@ -0,0 +1,3 @@
              (while
                  (progn
                    (message "before diff hunk next")
                    (diff-hunk-next)
                    ;;(message "after diff hunk next")
                    ;; don't go past the expected file
                    (if (> (point) start-of-next-file)
                        (progn
                          (message "after diff hunk next2a")
                          (goto-char start-of-next-file) nil)
                      ;;(message "after diff hunk next2")
                      (let* ((stage-hunk-header (buffer-substring-no-properties
                                                 (line-beginning-position)
                                                 (line-end-position)))
                             (stage-hunk-header-start
                              (progn
                                ;;(message "after diff hunk next2b")
                                (string-match hunk-header-re stage-hunk-header)
                                (string-to-number
                                 (substring stage-hunk-header (match-beginning 1) (match-end 1)))
                                )
                              ))
                        (message "stage hunk header start %s %s %s" stage-hunk-header-start
                                 hunk-header-start
                                 (> hunk-header-start stage-hunk-header-start))
                        (> hunk-header-start stage-hunk-header-start)
                        )
                      )
                    )
                ))
            )
          ;;(ignore-errors (diff-hunk-next))
          (message "yanking after %s"
                   (buffer-substring-no-properties (line-beginning-position)
                                                   (line-end-position)))
          (when (looking-at hunk-header-re)
            (message "goto prev line %s"
                     (buffer-substring-no-properties (line-beginning-position)
                                                     (line-end-position)))
            (previous-line))
          (end-of-line)
          
          (yank)
          (save-excursion
            (diff-hunk-prev)

            ;; don't want to deal with the headers and they sometimes cause
            ;; "patch fragment without header" errors
            ;; not sure, maybe something to do with our ordering?
            (re-search-forward hunk-header-re)
            (delete-region (point) (line-end-position)) 
            )
          )
        (run-hooks 'vc-diff-finish-functions)

        (diff-setup-whitespace)
        (diff-setup-buffer-type)
        )
      )
    )

  ;; (vc-call-backend 'git 'diff "/home/jason/.emacs.d/vimilla-emacs.org" "HEAD^" "HEAD" (current-buffer) 1)

  (add-to-list 'display-buffer-alist
               '("\\*vc-stage-diff\\*"
                 (display-buffer-below-selected)))

  (defun vc-diff-internal-ad (&rest args)
    (ignore-errors (kill-buffer "*vc-stage-diff*"))
    (clone-buffer "*vc-stage-diff*")
    (with-current-buffer (get-buffer-create "*vc-stage-diff*")
      (read-only-mode -1)
      (erase-buffer)
      (vc-setup-buffer (current-buffer))
      )
    )

  (advice-add #'diff-hunk-kill :around #'diff-kill-hunk-a)
  (advice-add #'vc-diff-internal :after #'vc-diff-internal-ad)
#+end_srC

* speedbar
use as a dummy file viewer
#+begin_src elisp
  (use-package speedbar :defer t
    :config
    (setq speedbar-show-unknown-files t)
    (setq speedbar-frame-parameters (delete '(minibuffer) speedbar-frame-parameters))
    (setq speedbar-update-flag nil)
    (setq my/speedbar-vi-state-modify-map (make-sparse-keymap))
    (define-key my/speedbar-vi-state-modify-map (kbd "<tab>") #'speedbar-toggle-line-expansion)
    (define-key my/speedbar-vi-state-modify-map (kbd "C-i") #'speedbar-toggle-line-expansion)
    (define-key my/speedbar-vi-state-modify-map (kbd "-") #'speedbar-up-directory)
    (viper-modify-major-mode 'speedbar-mode 'vi-state my/speedbar-vi-state-modify-map))
#+end_src

