init.el

(use-package vc :config
  (setq-default vc-handled-backends '(SVN Git Hg))
  (setq vc-git-diff-switches '("--histogram" "--diff-algorithm=histogram"))
  )

(use-package speedbar :defer t
  :config
  (setq speedbar-show-unknown-files t)
  (setq speedbar-frame-parameters (delete '(minibuffer) speedbar-frame-parameters))
  (setq speedbar-update-flag nil)
  (setq my/speedbar-vi-state-modify-map (make-sparse-keymap))
  (define-key my/speedbar-vi-state-modify-map (kbd "<tab>") #'speedbar-toggle-line-expansion)
  (define-key my/speedbar-vi-state-modify-map (kbd "C-i") #'speedbar-toggle-line-expansion)
  (define-key my/speedbar-vi-state-modify-map (kbd "-") #'speedbar-up-directory)
  (viper-modify-major-mode 'speedbar-mode 'vi-state my/speedbar-vi-state-modify-map))

(use-package ibuffer :defer t
  :config
