vimilla-emacs.org
* ibuffer
#+begin_src elisp
  (use-package ibuffer :defer t
    :config
    ;; add project level grouping
    (defun set-ibuffer-project-groups ()
      (setq ibuffer-saved-filter-groups
            (list (let ((l (seq-filter #'identity
                                       (cl-mapcar
                                        (lambda (p)
                                          (let* ((project (project--find-in-directory (car p)))
                                                 (pname (project-name project))
                                                 (pbufs (cl-find-if (lambda (b) (buffer-file-name b)) (project-buffers project))))
                                            (when pbufs
                                              `( ,pname (filename . ,pname)))))
                                        (seq-filter
                                         (lambda (p) (project-buffers (project--find-in-directory (car p))))
                                         project--list)))))
                    (add-to-list 'l "projects"))))
      (ibuffer-switch-to-saved-filter-groups "projects"))
    (add-hook 'ibuffer-hook #'set-ibuffer-project-groups))
#+end_src

* simple project bookmarks
#+begin_src elisp
  (setq bookmark-use-annotations t)
  (setq bookmark-save-flag 1)
  (setq bookmark-automatically-show-annotations nil)

                                          ; note the call-interactively does pass the prefix args
  (defun my/set-project-bookmark ()
    (interactive)
    (minibuffer-with-setup-hook
        (lambda ()
          (let ((prefix (concat (project-name (project-current)) ": ")))
            (when (project-name (project-current))
              (insert prefix))))
      (call-interactively 'bookmark-set)))

  (defun my/jump-to-project-bookmark ()
    (interactive)
    (minibuffer-with-setup-hook
        (lambda ()
          (let ((prefix (concat (project-name (project-current)) ": ")))
            (when (project-name (project-current))
              (insert prefix))))
      (call-interactively 'bookmark-jump)))


  (viper-map! :leader 
              "nrf" #'my/jump-to-project-bookmark
              "bmm" #'my/set-project-bookmark
              "bmj" #'my/jump-to-project-bookmark)
#+end_src


* development
** set environment vars at path
this might be nice if we need to set env vars without direnv

idea is to maybe pass some shell command to cd into a folder
and source some.envrc, then using that same shell, just copy all the environment vars from there using =setenv=
#+begin_src elisp
  (defun split-string-at-first-match (string regex)
    (let ((pos (string-match regex string)))
      (if pos
          (list (substring string 0 pos)
                (substring string (+ pos (length (match-string 0 string)))))
        (list string))))
                               
  (defun copy-env-vars-from-shell-1 (cmd)
    (mapc (lambda (env-var-string)
            (let* ((split (split-string-at-first-match env-var-string "="))
                   (name (cl-first split))
                   (val (cl-second split)))
              (when (and name val)
                (setq val (string-replace " " "\\ " val))
                (setenv name val)
                (when (string-equal "PATH" name)
                  (setq exec-path (append (parse-colon-path val) (list exec-directory)))
                  ;; eshell path
                  (setq-default eshell-path-env val)
                  (when (fboundp 'eshell-set-path) (eshell-set-path val))))))
          (split-string (shell-command-to-string cmd) "\n")))

  (defun copy-env-vars-from-shell ()
    (interactive)
    (copy-env-vars-from-shell-1 "bash --login -i -c printenv"))
#+end_src

** tramp environment variables
#+begin_src elisp
  (defun get-docker-env-vars ()
    "Gets the environment variables set by ENV in dockerfile by looking at /proc/1/environ.
      Meant for eshell in mind."
    (interactive)
    (mapc (lambda (env-var-string)
            (let* ((split (split-string env-var-string "="))
                   (name (cl-first split))
                   (val (cl-second split)))
              (unless (string-equal "TERM" name)
                (if (string-equal "PATH" name)
                    (progn
                      ;; eshell path
                      (setq eshell-path-env val)
                      (when (fboundp 'eshell-set-path) (eshell-set-path val)))
                  (setenv name val)))))
          (split-string (shell-command-to-string "tr \'\\0\' \'\\n\' < /proc/1/environ") "\n")))

  (use-package tramp :defer t
    :config
    (add-to-list 'tramp-remote-path 'tramp-own-remote-path)
    (setq enable-remote-dir-locals t)


    (setq tramp-ssh-controlmaster-options (concat "-o ControlPath=/tmp/ssh-ControlPath-%%r@%%h:%%p " "-o ControlMaster=auto -o ControlPersist=yes"))
    (setq tramp-use-ssh-controlmaster-options t)

    (defun dired-do-delete-advice-remote (orig-fun &rest args)
      ;; this way we use the default value as opposed to the alternative of
      ;; setting delete-by-moving-to-trash to the value of (file-remote-p default-directory)
      (if (file-remote-p default-directory)
          (let ((delete-by-moving-to-trash nil))
            (apply orig-fun args)
            )
        (apply orig-fun args)
        )
      )
    (advice-add 'dired-internal-do-deletions :around #'dired-do-delete-advice-remote)
    )

  (with-eval-after-load 'tramp
    (add-to-list 'tramp-methods
                 '("sshx11"
                   (tramp-login-program        "ssh")
                   (tramp-login-args           (("-l" "%u") ("-p" "%p") ("%c")
                                                ("-e" "none") ("-X") ("%h")))
                   (tramp-async-args           (("-q")))
                   (tramp-remote-shell         "/bin/sh")
                   (tramp-remote-shell-login   ("-l"))
                   (tramp-remote-shell-args    ("-c"))
                   (tramp-gw-args              (("-o" "GlobalKnownHostsFile=/dev/null")
                                                ("-o" "UserKnownHostsFile=/dev/null")
                                                ("-o" "StrictHostKeyChecking=yes")
                                                ("-o" "ForwardX11=yes")))
                   (tramp-default-port         22)))
    (tramp-set-completion-function "sshx11" tramp-completion-function-alist-ssh))
#+end_src

** qol
#+begin_src elisp
  (add-hook 'prog-mode-hook #'flymake-mode)
  (setq treesit-font-lock-level 4)
  (setq-default indent-tabs-mode nil)
  (which-function-mode)
  (setq which-func-display 'header)
  (add-hook 'prog-mode-hook
            (lambda ()
              (unless (eq major-mode 'web-mode)
                (electric-pair-local-mode))))
  (add-hook 'prog-mode-hook #'hs-minor-mode)
#+end_src

*** which-key
This is built into emacs30 now
#+begin_src elisp
  (use-package which-key :defer 2
    :config
    (which-key-mode))
#+end_src



*** flymake diagnostic at point function
#+begin_src elisp
  (defun my/flymake-diagnostics-at-point ()
    (interactive)
    (let ((diags (flymake-diagnostics (point))))
      (if (not (seq-empty-p diags))
          (message "%s"
                   (cl-reduce (lambda (acc d) (concat acc (flymake--diag-text d)))
                              (flymake-diagnostics (point))
                              :initial-value ""))
        (message "No diagnostics at point."))))

  (use-package flymake :defer t
    :config
    (viper-map! :leader
                "cx" #'my/flymake-diagnostics-at-point
                "cX" #'flymake-show-buffer-diagnostics)
    (viper-map! :n "C-c x" #'my/flymake-diagnostics-at-point)
    )
#+end_src

*** compilaton mode in side window
#+begin_src elisp
  (add-to-list 'display-buffer-alist '((major-mode . compilation-mode)
                                       (display-buffer-in-side-window)))
#+end_src

*** flymake project diagnostics in side window
#+begin_src elisp
  (add-to-list 'display-buffer-alist
               '((or (major-mode . flymake-project-diagnostics-mode)
                     (major-mode . flymake-diagnostics-buffer-mode))
                 (display-buffer-in-side-window)))
#+end_src

*** eldoc display buffer in bottom side window
#+begin_src elisp
  (add-to-list 'display-buffer-alist
               '("\\*eldoc.*\\*"
                 (display-buffer-in-side-window)))
#+end_src

*** help display buffer in bottom side window
#+begin_src elisp
  (add-to-list 'display-buffer-alist
               '((major-mode . help-mode)
                 (display-buffer-in-side-window)
                 (window-height . 0.35)))
#+end_src

*** messages display buffer in bottom side window
#+begin_src elisp
  (add-to-list 'display-buffer-alist
               '((major-mode . messages-buffer-mode)
                 (display-buffer-in-side-window)
                 (window-height . 0.15)))
#+end_src

