vimilla-emacs.org
** arduino
#+begin_src elisp
  (define-derived-mode arduino-mode c-mode "arduino"
    "My own mode which is a wrapper for c-mode for editing arduino files.")
  (use-package eglot :defer t
    :config
    (add-to-list 'eglot-server-programs '(arduino-mode . ("~/go/1.22.2/bin/arduino-language-server"
                                                          "-clangd" "/usr/bin/clangd"
                                                          "-cli" "/opt/homebrew/bin/arduino-cli"
                                                          "-cli-config" "/Users/jasonzhen/Library/Arduino15/arduino-cli.yaml"
                                                          "-fqbn" "arduino:avr:uno"))))

  (add-hook 'arduino-mode-hook #'eglot-ensure)

  (add-to-list 'auto-mode-alist '("\\.ino\\'" . arduino-mode))
#+end_src

** golang

#+begin_src elisp
  (add-to-list 'auto-mode-alist '("\\.go\\'" . go-ts-mode))
  (add-hook 'go-ts-mode-hook #'eglot-ensure)

  (use-package go-ts-mode :defer t
    :config
    (setq go-ts-mode-indent-offset tab-width))

  (defun unset-go-env-vars ()
    "This is needed so that for example, if one project has a go work file but the other doesn't,
    we don't still use the other project's go work file."
    (mapc (lambda (env-var-string)
            (let* ((split (split-string env-var-string "="))
                   (name (cl-first split)))
              (when (and name (not (string-empty-p name)))
                (setenv name ""))))
          (split-string (shell-command-to-string "bash --login -c \"go env\"") "\n")))

  (defun copy-go-env-vars-from-shell ()
    (interactive)
    (unset-go-env-vars)
    (copy-env-vars-from-shell)
    (mapc (lambda (env-var-string)
            (let* ((split (split-string env-var-string "="))
                   (name (cl-first split))
                   (val (cl-second split)))
              (when (and name val (not (string-empty-p name)) (not (string-empty-p val)))
                (setenv name (string-trim val "[ '\"]" "[ '\"]")))))
          (split-string (shell-command-to-string "bash --login -c \"go env\"") "\n"))
    (call-interactively 'eglot-reconnect))
#+end_src

*** Steal some qol stuff from doom
#+begin_src elisp
  (defvar +go-test-last nil
    "The last test run.")

  (defun +go--spawn (cmd)
    (save-selected-window
      (compile cmd)))

  (defun +go--run-tests (args)
    (let ((cmd (concat "go test -test.v " args)))
      (setq +go-test-last (concat "cd " default-directory ";" cmd))
      (+go--spawn cmd)))

  (defun +go/test-single ()
    "Run single test at point."
    (interactive)
    (if (string-match "_test\\.go" buffer-file-name)
        (save-excursion
          (re-search-backward "^func[ ]+\\(([[:alnum:]]*?[ ]?[*]?[[:alnum:]]+)[ ]+\\)?\\(Test[[:alnum:]_]+\\)(.*)")
          (+go--run-tests (concat "-run" "='^\\Q" (match-string-no-properties 2) "\\E$'")))
      (error "Must be in a _test.go file")))

  (defun +go/test-file ()
    "Run all tests in current file."
    (interactive)
    (if (string-match "_test\\.go" buffer-file-name)
        (save-excursion
          (goto-char (point-min))
          (let ((func-list))
            (while (re-search-forward "^func[ ]+\\(([[:alnum:]]*?[ ]?[*]?[[:alnum:]]+)[ ]+\\)?\\(Test[[:alnum:]_]+\\)(.*)" nil t)
              (push (match-string-no-properties 2) func-list))
            (+go--run-tests (concat "-run" "='^(" (string-join func-list "|")  ")$'"))))
      (error "Must be in a _test.go file")))

  (use-package go-ts-mode :defer t
    :config
    (setq my/go-vi-state-modify-map (make-sparse-keymap))
    (define-key my/go-vi-state-modify-map " mts" #'+go/test-single)
    (define-key my/go-vi-state-modify-map " mtf" #'+go/test-file)
    (viper-modify-major-mode 'go-ts-mode 'vi-state my/go-vi-state-modify-map))
#+end_src

** python
#+begin_src elisp
  (add-hook 'python-mode-hook (lambda () (setq-local tab-width python-indent-offset)))
  (add-hook 'python-ts-mode-hook (lambda () (setq-local tab-width python-indent-offset)))
#+end_src

*** basic venv wrapper
#+begin_src elisp
  (defvar before-venv-process-environment nil
    "Process environment with no venv")

  (defvar before-venv-exec-path nil
    "Exec path with no venv")

  (defvar venv-mode-line-indicator "")


  (defun copy-pipenv-vars-from-shell ()
    (interactive)
    (if before-venv-process-environment
        (setq process-environment before-venv-process-environment)
      (setq before-venv-process-environment process-environment))

    (copy-env-vars-from-shell-1 "bash --login -i -c \"pipenv run printenv\""))


  (defun copy-python-venv-vars-from-shell ()
    (interactive)
    (if before-venv-exec-path
        (setq exec-path (copy-sequence exec-path))
      (setq before-venv-exec-path (copy-sequence exec-path)))

    (if before-venv-process-environment
        (setq process-environment (copy-sequence before-venv-process-environment))
      (setq before-venv-process-environment (copy-sequence process-environment)))

    (let ((venv-name (read-directory-name "venv folder:" nil nil nil nil)))
      (setq venv-mode-line-indicator (concat "venv:" (project-name (project-current nil venv-name))))
      (add-to-list 'mode-line-misc-info '(t venv-mode-line-indicator)) 
      (copy-env-vars-from-shell-1 (format "bash --login -i -c \". %s && printenv\""
                                          (concat venv-name "bin/activate")))))


  (defun deactivate-python-venv ()
    (interactive)
    (setq exec-path before-venv-exec-path)
    (setq process-environment before-venv-process-environment)
    (setq before-venv-process-environment nil
          before-venv-exec-path nil) 

    (setq-default eshell-path-env (mapconcat #'identity before-venv-exec-path ":"))
    (when (fboundp 'eshell-set-path)
      (eshell-set-path (mapconcat #'identity before-venv-exec-path ":")))
    (setq mode-line-misc-info (delete '(t venv-mode-line-indicator) mode-line-misc-info)))
#+end_src

** javascript/typescript

for typescript, when installing interactively, need to make sure that for the subdirectory where
parser.c lives, we input typescript/src

some weird issue with typescript treesitter v0.20.4, would avoid that branch until its fixed <2024-02-08 Thu>
#+begin_src elisp
  (setq-default tab-width 4)

  (use-package js :defer t
    :config
    (setq js-indent-level 4)
    (add-hook 'js-mode-hook #'eglot-ensure))

  (use-package typescript-ts-mode :defer t
    :config
    (setq typescript-ts-mode-indent-offset 4)
    (add-hook 'typescript-ts-mode-hook #'eglot-ensure))

  (add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js-ts-mode))
#+end_src

** elisp highlighting
:PROPERTIES:
:VISIBILITY: folded
:END:

stole most of this from doom
https://github.com/doomemacs/doomemacs/blob/03d692f129633e3bf0bd100d91b3ebf3f77db6d1/modules/lang/emacs-lisp/autoload.el#L346-L381

#+begin_src elisp
  (use-package elisp-mode :defer t
    :config
    (require 'advice) ;; for ad-get-orig-definition

    (defun +emacs-lisp-highlight-vars-and-faces (end)
      "Match defined variables and functions.

    Functions are differentiated into special forms, built-in functions and
    library/userland functions"
      (catch 'matcher
        (while (re-search-forward "\\(?:\\sw\\|\\s_\\)+" end t)
          (let ((ppss (save-excursion (syntax-ppss))))
            (cond ((nth 3 ppss)  ; strings
                   (search-forward "\"" end t))
                  ((nth 4 ppss)  ; comments
                   (forward-line +1))
                  ((let ((symbol (intern-soft (match-string-no-properties 0))))
                     (and (cond ((null symbol) nil)
                                ((eq symbol t) nil)
                                ((keywordp symbol) nil)
                                ((special-variable-p symbol)
                                 (setq +emacs-lisp--face 'font-lock-variable-name-face))
                                ((and (fboundp symbol)
                                      (eq (char-before (match-beginning 0)) ?\()
                                      (not (memq (char-before (1- (match-beginning 0)))
                                                 (list ?\' ?\`))))
                                 (let ((unaliased (indirect-function symbol)))
                                   (unless (or (macrop unaliased)
                                               (special-form-p unaliased))
                                     (let (unadvised)
                                       (while (not (eq (setq unadvised (ad-get-orig-definition unaliased))
                                                       (setq unaliased (indirect-function unadvised)))))
                                       unaliased)
                                     (setq +emacs-lisp--face
                                           (if (subrp unaliased)
                                               'font-lock-constant-face
                                             'font-lock-function-name-face))))))
                          (throw 'matcher t)))))))
        nil))

    (font-lock-add-keywords 'emacs-lisp-mode `((+emacs-lisp-highlight-vars-and-faces . +emacs-lisp--face)) 'append))
#+end_src
                
