init.el

(defun my/eshell-in-bottom-side-window (arg)
  (interactive "P")
  (let ((eshell-buffer (save-window-excursion (eshell))))
    (select-window (display-buffer-in-side-window eshell-buffer '()))))

(defun my/eshell-send-cmd-async ()
  (interactive)
  (let ((cmd (string-trim (buffer-substring-no-properties eshell-last-output-end (progn (end-of-line) (point))))))
    (unless (eshell-head-process)
      (delete-region eshell-last-output-end (point))
      (insert (format "async-shell-command \"%s\"" cmd)))))

(use-package eshell :defer t
  :config
  (add-to-list 'eshell-modules-list 'eshell-tramp)
  (setq my/eshell-vi-state-modify-map (make-sparse-keymap))
  (setq my/eshell-insert-state-modify-map (make-sparse-keymap))

  (define-key my/eshell-vi-state-modify-map (kbd "C-<return>") #'my/eshell-send-cmd-async)
  (define-key my/eshell-vi-state-modify-map " ma" #'my/eshell-send-cmd-async)
  (define-key my/eshell-insert-state-modify-map (kbd "C-<return>") #'my/eshell-send-cmd-async)
  (define-key my/eshell-insert-state-modify-map (kbd "M-<return>") #'my/eshell-send-cmd-async)

  (defun slurp (f)
    (with-temp-buffer
      (insert-file-contents f)
      (buffer-substring-no-properties (point-min) (point-max))))

  (define-key my/eshell-insert-state-modify-map (kbd "C-r")
              (lambda ()
                (interactive)
                (let ((selected (completing-read "History: "
                                                 (cl-remove-if-not
                                                  (lambda (elem)
                                                    (text-properties-at 0 elem))
                                                  (ring-elements eshell-history-ring)))))
                  (when selected 
                    (end-of-line)
                    (eshell-kill-input)
                    (insert selected)))))
  (viper-modify-major-mode 'eshell-mode 'vi-state my/eshell-vi-state-modify-map)
  (viper-modify-major-mode 'eshell-mode 'insert-state my/eshell-insert-state-modify-map))

(use-package eshell :after consult :config
  (define-key my/eshell-insert-state-modify-map (kbd "C-r") #'consult-history))

(defun my/shell-in-bottom-side-window (arg)
  (interactive "P")
  (let ((shell-buffer (save-window-excursion (shell))))
    (select-window (display-buffer-in-side-window shell-buffer '()))))

(use-package shell :defer t
  :config
  (setq my/shell-insert-state-modify-map (make-sparse-keymap))

  (define-key my/shell-insert-state-modify-map (kbd "<up>") #'comint-previous-input)
  (define-key my/shell-insert-state-modify-map (kbd "<down>") #'comint-next-input)
  (define-key my/shell-insert-state-modify-map (kbd "C-r")
              (lambda ()
                (interactive)
                (let ((selected (completing-read "History: "
                                                 (cl-remove-if-not
                                                  (lambda (elem)
                                                    (text-properties-at 0 elem))
                                                  (ring-elements comint-input-ring)))))
                  (when selected
                    (end-of-line)
                    (comint-kill-input)
                    (insert selected)))))
  (viper-modify-major-mode 'shell-mode 'insert-state my/shell-insert-state-modify-map))

(use-package shell :after consult :config
  (define-key my/shell-insert-state-modify-map (kbd "C-r") #'consult-history))

(when (display-graphic-p) ;; only matter for gui emacs
  (setq current-font-height 160)
  (defun set-fonts ()
    (message "setting fonts")
    (cond ((member "FantasqueSansM Nerd Font Propo" (font-family-list))
           (ignore-errors (set-face-attribute 'default nil :font "FantasqueSansM Nerd Font Propo" :height current-font-height)))
          ((member "IosevkaCustom Nerd Font Propo" (font-family-list))
           (ignore-errors (set-face-attribute 'default nil :font "FantasqueSansM Nerd Font Propo" :height current-font-height)))
          (t (message "None of my preferred mono fonts found, will use defaults")))

    (cond ((member "Comic Neue" (font-family-list))
           (set-face-attribute 'variable-pitch nil :font "Comic Neue" :height current-font-height))
          ((member "Iosevka Etoile" (font-family-list))
           (set-face-attribute 'variable-pitch nil :font "Iosevka Etoile" :height current-font-height))
          (t (message "None of my preferred variable pitch fonts found, will use defaults")))

    (ignore-errors (set-fontset-font t 'emoji "Noto Color Emoji" nil 'append))
    (ignore-errors (set-fontset-font t 'emoji "Apple Color Emoji" nil 'append))
    (ignore-errors (set-fontset-font t 'unicode "Iosevkacustom Nerd Font Propo" nil 'append)))

  (add-hook 'after-make-frame-functions #'set-fonts)
  ;; for some reason this is kinda busted in emacs daemon
  (add-hook 'emacs-startup-hook (lambda () (remove-hook 'after-make-frame-functions #'set-fonts)))
  (set-fonts)

  (defun my/set-font-size ()
    (interactive)
    (let ((new-size (string-to-number
                     (minibuffer-with-setup-hook
                         (lambda () (insert (number-to-string current-font-height)))
                       (read-string "Edit font size: ")))))
      (setq current-font-height new-size)
      (set-face-attribute 'default nil :height new-size)
      (set-face-attribute 'variable-pitch nil :height new-size))))

(setq modus-themes-headings
      '((1 . (rainbow overline background variable-pitch 1.25))
        (2 . (rainbow background variable-pitch 1.15))
        (3 . (rainbow bold variable-pitch 1.1))
        (t . (semilight variable-pitch 1.05))))


(setq modus-themes-bold-constructs t)
(setq modus-themes-italic-constructs t)
(setq modus-themes-org-blocks 'gray-background)
;; (load-theme 'modus-operandi)
;; (use-package vc :defer t
;;   :config
;;   ;; for some reason modus gets rid of diff-header
;;   (set-face-attribute 'diff-header nil :background "gray80"))
