vimilla-emacs.org
* Tab bar
basically minimal projectile and persp
#+begin_src elisp
  (defun find-git-dir (dir)
    "Search up the directory tree looking for a .git folder."
    (cond
     ((eq major-mode 'dired-mode) "Dired")
     ((not dir) "process")
     ((string= dir "/") "no-git")
     (t (vc-root-dir))))

  (defun git-tabbar-buffer-groups ()
    "Groups tabs in tabbar-mode by the git repository they are in."
    (list (find-git-dir (buffer-file-name (current-buffer)))))

  (defun get-file-buffers-in-window ()
    (seq-filter #'buffer-file-name
                (delete-dups (mapcar #'window-buffer
                                     (window-list-1 (frame-first-window)
                                                    'nomini)))))

  (defun tab-bar-tab-name-projects ()
    (let ((file-buffers (get-file-buffers-in-window)))
      (if file-buffers
          (mapconcat #'identity
                     (delete-dups
                      (cl-mapcar (lambda (b)
                                   (with-current-buffer b
                                     (if (project-current)
                                         (project-name (project-current))
                                       (buffer-name))))
                                 file-buffers))
                     ", ")
        (tab-bar-tab-name-current))))

  (setq tab-bar-tab-name-function #'tab-bar-tab-name-projects)
  ;; (truncate-string-to-width (tab-bar-tab-name-all) (/ (frame-width) (length (tab-bar-tabs))))

  (defun get-tab-names (&rest _)
    (interactive "P")
    (message "%s"
             (mapconcat
              (lambda (tab)
                (let* ((current-tab-p (eq (car tab) 'current-tab))
                       (idx (number-to-string (1+ (tab-bar--tab-index tab))))
                       (tab-name1 (concat "[" idx "] " (cdr (cl-second tab))))
                       (tab-name (if current-tab-p (propertize tab-name1 'face '(:inherit font-lock-builtin-face :underline t)) tab-name1)))
                  tab-name))
              (tab-bar-tabs)
              "  ")))

  (advice-add 'tab-bar-new-tab :after #'get-tab-names)
  (advice-add 'tab-bar-close-tab :after #'get-tab-names)
  (advice-add 'tab-bar-select-tab :after #'get-tab-names)

  (viper-map! :leader "<tab><tab>" #'get-tab-names
              "<tab>{" (lambda (arg)
                         (interactive "P")
                         (tab-bar-move-tab (if arg (- arg) -1))
                         (get-tab-names))
              "<tab>}" (lambda (arg)
                         (interactive "P")
                         (tab-bar-move-tab (if arg arg 1))
                         (get-tab-names))
              )

  (setq tab-bar-show nil)
  (tab-bar-mode)
#+end_src

** set tab bar name on project switch
#+begin_src elisp
  (defun rename-tab-to-current-project (dir)
    (message (project-name (project-current)))
    (tab-bar-rename-tab (project-name (project-current))))

  (advice-add 'project-switch-project :after #'rename-tab-to-current-project)
#+end_src

* eww
lookup with eww first, then use =eww-browse-with-external-browser= if we need to browse in a normal browser
#+begin_src elisp
  (setq browse-url-browser-function 'eww-browse-url)
  (add-hook 'eww-after-render-hook 'eww-readable)
#+end_src

display eww in side window with a large height
#+begin_src elisp
  (add-to-list 'display-buffer-alist
               '("\\*eww\\*"
                 (display-buffer-in-side-window)
                 (window-height . 0.5)))
#+end_src

* Custom Modeline
#+begin_src elisp
  (defun save-narrowing-info (pos1 pos2)
    (setq narrowed-pos1 (line-number-at-pos pos1))
    (setq narrowed-pos2 (line-number-at-pos pos2)))

  (defun modeline-setup ()

    (defface mode-line-pink
      (if (facep 'modus-themes-fg-magenta-cooler)
          '((t :inherit modus-themes-fg-magenta-cooler))
      '((t :foreground "magenta")))
      "face used for modeline"
      :group 'basic-faces)

    (defface mode-line-cyan
      (if (facep 'modus-themes-fg-cyan-cooler)
          '((t :inherit modus-themes-fg-cyan-cooler))
      '((t :foreground "cyan1")))
      "face used for modeline"
      :group 'basic-faces)

    (advice-add 'narrow-to-region :before #'save-narrowing-info)

    (setq project-mode-line t)
    (setq-default mode-line-buffer-identification
                  `(:eval
                    (let ((s (format-mode-line
                              (propertized-buffer-identification (buffer-name)))))
                      (when (and (boundp 'uniquify-managed) uniquify-managed)
                        (unless (string= (buffer-name) (uniquify-buffer-base-name))
                          (let ((base-len (length (uniquify-buffer-base-name)))
                                (full-len (length (buffer-name)))
                                (pre (eq uniquify-buffer-name-style 'post-forward-angle-brackets)))
                            (let ((start (if pre 0 base-len))
                                  (end (if pre (- full-len base-len) full-len)))
                              (set-text-properties base-len full-len '(face (:inherit mode-line-cyan :weight bold)) s)))))
                      s)))

    (defvar viper-mode-string "") ;; will be loaded later unless we go away from viper mode

    (set-face-attribute 'mode-line-buffer-id nil :inherit 'mode-line-pink :weight 'bold)
    (setq project-mode-line-face 'package-name)
    (setq project-file-history-behavior 'relativize)

    (setq-default mode-line-format '("%e" mode-line-front-space
                                     (:eval (propertize viper-mode-string)) ;; not sure why we need this, but otherwise the props don't show up
                                     ;; kbd macro info
                                     (:eval (when defining-kbd-macro
                                              (concat mode-line-defining-kbd-macro
                                                      (propertize (format "@%s" (char-to-string evil-this-macro)) 'face 'success))))
                                     mode-line-window-dedicated
                                     mode-line-modified mode-line-remote
                                     (project-mode-line project-mode-line-format) " "
                                     mode-line-buffer-identification " "
                                     mode-line-position "<" (:eval (format "%d" (line-number-at-pos (point-max))))
                                     (:eval (when (buffer-narrowed-p) (format " >%d:%d<" narrowed-pos1 narrowed-pos2))) " "
                                     ;; selection position info
                                     (:eval (when (region-active-p)
                                              (propertize (concat
                                                           (number-to-string (1+ (abs (- (line-number-at-pos (point)) (line-number-at-pos (mark)))))) "L"
                                                           (number-to-string (1+ (abs (- (current-column) (save-excursion (goto-char (mark)) (current-column)))))) "C")
                                                          'face 'warning)))
                                     " " (:propertize mode-name face (:weight bold :inherit mode-line-pink)) " " mode-line-misc-info mode-line-end-spaces))

    (column-number-mode)
    (line-number-mode)
    (size-indication-mode)
    )

  (add-hook 'after-make-frame-functions #'modeline-setup)
  (add-hook 'emacs-startup-hook #'modeline-setup)
#+end_src

* Viper
:PROPERTIES:
:header-args: :tangle viper :results silent
:END:

viper is the only built in thing that handles /some/ of the Doom/Vim stuff that I want (since it emulates Vi and not Vim)

** "g" prefix commands
*** beginning of buffer
#+begin_src elisp
  (setq my/g-prefix-map (make-sparse-keymap))
  (define-key viper-vi-basic-map "g" my/g-prefix-map)
  (define-key my/g-prefix-map "g" (lambda () (interactive) (viper-goto-line 1)))
#+end_src

*** movement since we have visual lines
#+begin_src elisp
  (define-key my/g-prefix-map "k" #'viper-previous-line)
  (define-key my/g-prefix-map "j" #'viper-next-line)
#+end_src
*** tab bar movement
#+begin_src elisp
  (define-key my/g-prefix-map "t" #'tab-bar-switch-to-next-tab)
  (define-key my/g-prefix-map "T" #'tab-bar-switch-to-prev-tab)
#+end_src

*** cua mode for multiple cursors
#+begin_src elisp
  (define-key my/g-prefix-map "zz" #'cua-rectangle-mark-mode)
#+end_src


