init.el

(defun find-git-dir (dir)
  "Search up the directory tree looking for a .git folder."
  (cond
   ((eq major-mode 'dired-mode) "Dired")
   ((not dir) "process")
   ((string= dir "/") "no-git")
   (t (vc-root-dir))))

(defun git-tabbar-buffer-groups ()
  "Groups tabs in tabbar-mode by the git repository they are in."
  (list (find-git-dir (buffer-file-name (current-buffer)))))

(defun get-file-buffers-in-window ()
  (seq-filter #'buffer-file-name
              (delete-dups (mapcar #'window-buffer
                                   (window-list-1 (frame-first-window)
                                                  'nomini)))))

(defun tab-bar-tab-name-projects ()
  (let ((file-buffers (get-file-buffers-in-window)))
    (if file-buffers
        (mapconcat #'identity
                   (delete-dups
                    (cl-mapcar (lambda (b)
                                 (with-current-buffer b
                                   (if (project-current)
                                       (project-name (project-current))
                                     (buffer-name))))
                               file-buffers))
                   ", ")
      (tab-bar-tab-name-current))))

(setq tab-bar-tab-name-function #'tab-bar-tab-name-projects)
;; (truncate-string-to-width (tab-bar-tab-name-all) (/ (frame-width) (length (tab-bar-tabs))))

(defun get-tab-names (&rest _)
  (interactive "P")
  (message "%s"
           (mapconcat
            (lambda (tab)
              (let* ((current-tab-p (eq (car tab) 'current-tab))
                     (idx (number-to-string (1+ (tab-bar--tab-index tab))))
                     (tab-name1 (concat "[" idx "] " (cdr (cl-second tab))))
                     (tab-name (if current-tab-p (propertize tab-name1 'face '(:inherit font-lock-builtin-face :underline t)) tab-name1)))
                tab-name))
            (tab-bar-tabs)
            "  ")))

(advice-add 'tab-bar-new-tab :after #'get-tab-names)
(advice-add 'tab-bar-close-tab :after #'get-tab-names)
(advice-add 'tab-bar-select-tab :after #'get-tab-names)

(setq tab-bar-show nil)
(tab-bar-mode)

(defun rename-tab-to-current-project (dir)
  (message (project-name (project-current)))
  (tab-bar-rename-tab (project-name (project-current))))

(advice-add 'project-switch-project :after #'rename-tab-to-current-project)

(setq browse-url-browser-function 'eww-browse-url)
(add-hook 'eww-after-render-hook 'eww-readable)

(add-to-list 'display-buffer-alist
             '("\\*eww\\*"
               (display-buffer-in-side-window)
               (window-height . 0.5)))

(defun save-narrowing-info (pos1 pos2)
  (setq narrowed-pos1 (line-number-at-pos pos1))
  (setq narrowed-pos2 (line-number-at-pos pos2)))

(defun modeline-setup () 
  (advice-add 'narrow-to-region :before #'save-narrowing-info)

  (set-face-attribute 'mode-line-buffer-id nil :inherit 'modus-themes-fg-magenta :weight 'bold)

  (setq-default mode-line-buffer-identification
                `(:eval
                  (let ((s (format-mode-line
                            (propertized-buffer-identification (buffer-name)))))
                    (when (and (boundp 'uniquify-managed) uniquify-managed)
                      (unless (string= (buffer-name) (uniquify-buffer-base-name))
                        (let ((base-len (length (uniquify-buffer-base-name)))
                              (full-len (length (buffer-name)))
                              (pre (eq uniquify-buffer-name-style 'post-forward-angle-brackets)))
                          (let ((start (if pre 0 base-len))
                                (end (if pre (- full-len base-len) full-len)))
                            (set-text-properties base-len full-len '(face (:inherit modus-themes-fg-cyan-cooler :weight bold)) s)))))
                    s)))

  (defvar viper-mode-string "") ;; will be loaded later unless we go away from viper mode

  (defface mode-line-pink
    (if (facep 'modus-themes-fg-magenta-cooler)
        '((t :inherit modus-themes-fg-magenta-cooler))
    '((t :foreground "magenta")))
    "face used for modeline"
    :group 'basic-faces)

  (setq-default mode-line-format '("%e" mode-line-front-space
                                   (:eval (propertize viper-mode-string)) ;; not sure why we need this, but otherwise the props don't show up
                                   ;; kbd macro info
                                   (:eval (when defining-kbd-macro (concat mode-line-defining-kbd-macro
                                                                           (propertize (format "@%s" (char-to-string evil-this-macro)) 'face 'success))))
                                   mode-line-modified mode-line-remote " " mode-line-buffer-identification " "
                                   mode-line-position "<" (:eval (format "%d" (line-number-at-pos (point-max))))
                                   (:eval (when (buffer-narrowed-p) (format " >%d:%d<" narrowed-pos1 narrowed-pos2))) " "
                                   ;; selection position info
                                   (:eval (when (region-active-p)
                                            (propertize (concat
                                                         (number-to-string (1+ (abs (- (line-number-at-pos (point)) (line-number-at-pos (mark)))))) "L"
                                                         (number-to-string (1+ (abs (- (current-column) (save-excursion (goto-char (mark)) (current-column)))))) "C")
                                                        'face 'warning)))
                                   " " (:propertize mode-name face (:weight bold :inherit mode-line-pink)) " " mode-line-misc-info mode-line-end-spaces))

  (column-number-mode)
  (line-number-mode)
  (size-indication-mode)
  )

(add-hook 'after-make-frame-functions #'modeline-setup)
(add-hook 'emacs-startup-hook #'modeline-setup)
