vimilla-emacs.org
*** respect scroll margin
#+begin_src elisp
  (viper-map! :n "H"
              (lambda (arg) (interactive "P")
                (if arg (viper-window-top arg)
                  (viper-window-top (+ scroll-margin 1))))
              "L"
              (lambda (arg) (interactive "P")
                (if arg (viper-window-bottom arg)
                  (viper-window-bottom (+ scroll-margin 1))))
              "zz" #'recenter-top-bottom)
#+end_src

*** goto line not deactivating mark
#+begin_src elisp
  (advice-mapc `(lambda (fun props) (advice-remove 'viper-goto-line fun)) 'viper-goto-line)

  ;; if the region is active already, we don't want to move mark or else it behaves strangely with out selection
  (defun my/advise-viper-goto-line (orig-fun &rest args)
    (if (region-active-p)
        (cl-letf (((symbol-function 'deactivate-mark)
                   (lambda (&optional _) nil))
                  ((symbol-function 'viper-move-marker-locally)
                   (lambda (_ _ &optional _) nil))
                  ((symbol-function 'push-mark)
                   (lambda (&optional _ _ _) nil)))
          (let ((prev-line-number (line-number-at-pos)))
            (apply orig-fun args)

            (when my/line-selection-p
              ;; this means we're moving up so need to go to beg of line at the end
              (if (and (car args) (< (car args) prev-line-number))
                  (beginning-of-line)
                (end-of-line)))))
      (apply orig-fun args)))

  (advice-add 'viper-goto-line :around #'my/advise-viper-goto-line)
#+end_src

** code folding
#+begin_src elisp
  (use-package hideshow
    :config
    (viper-map! :n "zC" #'hs-hide-all "zO" #'hs-show-all
                "zo" #'hs-show-block "zc" #'hs-hide-block
                "za" #'hs-toggle-hiding))
#+end_src

** advise viper-brac/ket-function
holy shit lol..
viper-cmd.el:viper-brac-function or viper-ket-function

basically dynamically binding the read-char to return the initial read-char in the viper call so that we don't double prompt user for read-char

TODO: maybe make an easier way to add new bindings
otherwise this works lol
#+begin_src elisp
  ;; local alist that can be used as part of a major mode hook to
  ;; add pseudo keybinds to brac and ket
  (setq brac-char-cmd-alist '())
  ;; [ - backwards
  (defun viper-brac-advice (orig-fun &rest args)
    (let ((char (read-char)))
      (cond ((viper= ?b char) (previous-buffer))
            ((viper= ?t char) (tab-bar-switch-to-prev-tab))
            ((viper= ?e char) (call-interactively 'flymake-goto-prev-error))
            (t
             (let ((other-cmd
                    (cdr (cl-find-if (lambda (e)
                                       (viper= (car e) char))
                                     brac-char-cmd-alist))))
               (if other-cmd
                   (call-interactively other-cmd)
                 ;; hack so that we can override read-char and only need input once
                 (cl-letf (((symbol-function 'read-char) (lambda (_ _ _) char)))
                   (apply orig-fun args))))))))
  (advice-add 'viper-brac-function :around #'viper-brac-advice)

  (setq ket-char-cmd-alist '())
  ;; ] - forwards
  (defun viper-ket-advice (orig-fun &rest args)
    (let ((char (read-char)))
      (cond ((viper= ?b char) (next-buffer))
            ((viper= ?t char) (tab-bar-switch-to-next-tab))
            ((viper= ?e char) (call-interactively 'flymake-goto-next-error))
            (t
             (let ((other-cmd
                    (cdr (cl-find-if (lambda (e)
                                       (viper= (car e) char))
                                     ket-char-cmd-alist))))
               (if other-cmd
                   (call-interactively other-cmd)
                 ;; hack so that we can override read-char and only need input once
                 (cl-letf (((symbol-function 'read-char) (lambda (_ _ _) char)))
                   (apply orig-fun args))))))))
  (advice-add 'viper-ket-function :around #'viper-ket-advice)
#+end_src

** redefine viper-maybe-checkout to use ediff-file-checked-in-p
This is why when we save a file it asks us to check it out cause ex-write uses its own viper-file-checked-in-p
instead of ediff's version
Need to just redefine the maybe checkout function

See these:
[[file:/opt/homebrew/Cellar/emacs-plus@29/29.2/share/emacs/29.2/lisp/emulation/viper-ex.el::viper-maybe-checkout (current-buffer)]]
[[file:/opt/homebrew/Cellar/emacs-plus@29/29.2/share/emacs/29.2/lisp/emulation/viper-util.el::defun viper-maybe-checkout (buf]]
[[file:/opt/homebrew/Cellar/emacs-plus@29/29.2/share/emacs/29.2/lisp/vc/ediff-util.el::defun ediff-file-checked-in-p (file]]

#+begin_src elisp
  (use-package ediff :autoload (ediff-file-checked-in-p))

  (defun viper-maybe-checkout (buf)
    (let ((file (expand-file-name (buffer-file-name buf)))
          (checkout-function (key-binding "\C-x\C-q")))
      (if (and (ediff-file-checked-in-p file)
               (or (beep 1) t)
               (y-or-n-p
                (format
                 "File %s is checked in.  Check it out? "
                 (abbreviate-file-name file))))
          (with-current-buffer buf
            (command-execute checkout-function)))))
#+end_src

** extra VC keybindings
note after doing =vc-next-action=, running =vc-git-log-edit-toggle-amend= toggles the current commit to be an amend commit

#+begin_src elisp
  (define-key global-map "\C-xvf" #'vc-pull)
  (define-key global-map "\C-xvF" #'my/vc-git-fetch)

  (define-key global-map "\C-xve" #'my/vc-git-editor-command)
  (define-key global-map "\C-xvRi" #'my/vc-git-rebase-i)
  (define-key global-map "\C-xvRa" #'my/vc-git-rebase-abort)
  (define-key global-map "\C-xvRc" #'my/vc-git-rebase-continue)

  (define-key global-map "\C-xvSs" #'vc-git-stash)
  (define-key global-map "\C-xvSS" #'vc-git-stash-show)
  (define-key global-map "\C-xvSp" #'vc-git-stash-pop)
  (define-key global-map "\C-xvSa" #'vc-git-stash-apply)
  (define-key global-map "\C-xvSd" #'vc-git-stash-delete)
  (use-package vc-git :defer t
    :config
    (setq my/vc-log-vi-state-modify-map
          (make-composed-keymap
           nil
           (make-composed-keymap
            (list my/viper-vi-basic-motion-keymap
                  my/viper-vi-motion-g-keymap
                  my/viper-vi-motion-leader-keymap)
            vc-git-log-view-mode-map)))
    (define-key my/vc-log-vi-state-modify-map (kbd "C-j") #'log-view-msg-next)
    (define-key my/vc-log-vi-state-modify-map (kbd "C-k") #'log-view-msg-prev)
    (viper-modify-major-mode 'vc-git-log-view-mode 'vi-state my/vc-log-vi-state-modify-map))
#+end_src

*** VC Dir mode
#+begin_src elisp
  (use-package vc-dir :defer t
    :config
    (viper-map! :mode 'vc-dir-mode
                :n "x" #'vc-dir-hide-state)
    )
#+end_src

*** diff mode
#+begin_src elisp
  (use-package diff-mode :defer t
    :config
    (add-hook 'diff-mode-hook #'outline-minor-mode)
    (set-face-foreground 'diff-refine-added "green1")
    (set-face-background 'diff-refine-added "green4")

    (set-face-foreground 'diff-refine-removed "red1")
    (set-face-background 'diff-refine-removed "red4"))

  (use-package diff-mode :after outline
    :config
    (viper-map! :mode 'diff-mode
                :n "<tab>" #'outline-cycle
                "<backtab>" #'outline-cycle-buffer
                "<return>" #'diff-goto-source
                "C-j" #'diff-hunk-next
                "C-k" #'diff-hunk-prev
                "C-S-j" #'diff-file-next
                "C-S-k" #'diff-file-prev))
#+end_src

*** annotate
#+begin_src elisp
  (use-package vc-annotate :defer t
    :config
    (viper-map! :mode 'vc-annotate-mode
                :n "C-j" #'vc-annotate-next-revision
                "C-k" #'vc-annotate-prev-revision
                "L" #'vc-annotate-show-log-revision-at-line))
  (add-hook 'vc-annotate-mode-hook #'viper-mode)
#+end_src

** dired
#+begin_src elisp
  (use-package dired :defer t
    :config
    (add-hook 'dired-mode-hook #'auto-revert-mode)
    (viper-map! :mode 'dired-mode
                :n "-" #'dired-up-directory
                "C" #'dired-do-copy
                "K" #'dired-kill-subdir))
#+end_src

** ibuffer
#+begin_src elisp
  (use-package ibuffer :defer t
    :config
    (viper-map! :mode 'ibuffer-mode :n "sp" #'ibuffer-pop-filter "sn" #'ibuffer-filter-by-name))
#+end_src

** elisp eval buffer
#+begin_src elisp
  (viper-map! :mode 'emacs-lisp-mode :n "SPC meb" #'eval-buffer)
#+end_src

** comint mode
#+begin_src elisp
  (use-package comint :defer t
    :config
    (define-key viper-comint-mode-modifier-map (kbd "C-d") #'viper-scroll-up))
#+end_src

* yaml
#+begin_src elisp
  (add-to-list 'auto-mode-alist '("\\.yaml\\'" . yaml-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-ts-mode))
#+end_src

