vimilla-emacs.org
** corfu completion
#+begin_src elisp
  (use-package cape :ensure t :pin gnu)

  (use-package corfu :ensure t
    :init (global-corfu-mode)
    :config
    (advice-add 'eglot-completion-at-point :around #'cape-wrap-buster)
    (advice-add 'eglot-completion-at-point :around #'cape-wrap-noninterruptible)

    (setq corfu-auto t)
    (setq corfu-cycle t)
    (setq corfu-quit-no-match t)
    (setq corfu-quit-at-boundary t)
    (defun corfu-move-to-minibuffer ()
      (interactive)
      (pcase completion-in-region--data
        (`(,beg ,end ,table ,pred ,extras)
         (let ((completion-extra-properties extras)
               completion-cycle-threshold completion-cycling)
           (consult-completion-in-region beg end table pred)))))
    (define-key corfu-map (kbd "M-m") #'corfu-move-to-minibuffer)
    (define-key corfu-map (kbd "C-M-i") #'corfu-move-to-minibuffer)
    (define-key corfu-map (kbd "M-<tab>") #'corfu-move-to-minibuffer)
    (add-to-list 'corfu-continue-commands #'corfu-move-to-minibuffer))
#+end_src

#+begin_src elisp
  (use-package corfu-terminal :ensure t
    :config
    (unless (display-graphic-p) (corfu-terminal-mode)))
#+end_src

** bash completion
#+begin_src elisp
  (use-package bash-completion :ensure t
    :config
    (bash-completion-setup)
    
    (defun eshell-bash-capf ()
      (bash-completion-dynamic-complete-nocomint
       eshell-last-output-end))

    (add-hook 'eshell-mode-hook
              (lambda ()
                (add-hook 'completion-at-point-functions 'eshell-bash-capf nil t))))
#+end_src

** avy
avy jumping is so nice
https://github.com/abo-abo/avy

Otherwise we just use isearch and standard vi f/F motions
#+begin_src elisp
  (use-package avy :ensure t :pin gnu :defer 2
    :config
    (define-key viper-vi-basic-map "gss" #'avy-goto-char-2)
    (define-key viper-vi-basic-map "gs/" #'avy-goto-char-timer)
    (define-key viper-vi-basic-map "gs " #'avy-goto-char-timer))
#+end_src

** vundo

#+begin_src elisp
  (use-package vundo :ensure t :pin gnu
    :config
    (setq vundo-vi-modify-map vundo-mode-map)
    (define-key vundo-vi-modify-map "h" #'vundo-backward)
    (define-key vundo-vi-modify-map "l" #'vundo-forward)
    (define-key vundo-vi-modify-map "k" #'vundo-previous)
    (define-key vundo-vi-modify-map "j" #'vundo-next)
    (define-key vundo-vi-modify-map "d" #'vundo-diff)
    (viper-modify-major-mode 'vundo-mode 'vi-state vundo-vi-modify-map))
#+end_src

** my own hurl mode :)
well this oen is self explanatory
#+begin_src elisp
  (use-package json-mode :ensure t :pin gnu)

  (when (fboundp 'package-vc-install)
    (unless (require 'hurl-mode nil 'noerrror) (package-vc-install "https://github.com/JasZhe/hurl-mode"))
    (use-package hurl-mode :mode "\\.hurl\\'"
      :config
      (add-to-list 'display-buffer-alist
                   '("\\*hurl-response*\\*"
                     (display-buffer-in-side-window)
                     (window-height . 0.4)))))
#+end_src

** my own window stool mode :)
#+begin_src elisp
  (when (fboundp 'package-vc-install)
    (unless (require 'window-stool nil 'noerrror) (package-vc-install "https://github.com/JasZhe/window-stool"))
    (use-package window-stool :defer 2
      :config
      ;; only overlays in gui otherwises messes up with corfu overlay completions in terminal
      (setq window-stool-use-overlays nil)
      (add-hook 'org-mode-hook #'window-stool-mode)
      (add-hook 'prog-mode-hook #'window-stool-mode)))
#+end_src

** magit
I want to actually learn how to use the built in vc mode a lot more, but there are some cases where having magit is really nice i.e. rebasing or staging specific lines rather than the whole file.
#+begin_src elisp
  (use-package magit :after (vc-dir) :ensure t :pin nongnu
    :config
    (add-to-list 'auto-mode-alist '("/git-rebase-todo\\'" . git-rebase-mode))

    (viper-map! :leader "gg" #'magit

                :mode 'magit-status-mode
                :n "C-w" my-window-map
                "x" #'magit-discard
                "`" #'magit-process-buffer
                "E" #'magit-ediff
                "C-l" #'magit-log
                "C-b" #'magit-branch
                "p" #'magit-push
                "F" #'magit-pull
                "SPC gF" #'magit-fetch
                ;; for terminal issues with C-i
                "<tab>" (lambda () (interactive) (call-interactively (lookup-key magit-mode-map "\t")))

                :mode 'magit-diff-mode
                :n
                "C-w" #'my-window-map
                )

    (add-to-list 'display-buffer-alist
                 '("magit:.*"
                   (display-buffer-same-window))))
#+end_src

#+begin_src elisp
  (rassq-delete-all 'git-rebase-mode auto-mode-alist)
#+end_src

** diff-hl
#+begin_src elisp
  (use-package diff-hl :ensure t :pin gnu :after viper
    :config
    (global-diff-hl-mode)
    (unless (display-graphic-p) (diff-hl-margin-mode))

    (add-to-list 'display-buffer-alist
                 '("\\*diff-hl\\*" (display-buffer-in-side-window)))

    (viper-map! :leader "gr" #'diff-hl-revert-hunk
                "gs" #'diff-hl-show-hunk)

    (add-to-list 'brac-char-cmd-alist '(?d . (lambda () (interactive) (diff-hl-previous-hunk))))
    (add-to-list 'brac-char-cmd-alist '(?D . (lambda () (interactive) (diff-hl-show-hunk-previous))))

    (add-to-list 'ket-char-cmd-alist '(?d . (lambda () (interactive) (diff-hl-next-hunk))))
    (add-to-list 'ket-char-cmd-alist '(?D . (lambda () (interactive) (diff-hl-show-hunk-next))))
    (use-package magit :config
      (add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh)
      (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)))
#+end_src

** denote
#+begin_src elisp
  (use-package denote :ensure t :pin gnu :defer 2
    :config
    (setq denote-directory "~/orgmode/notes")
    (viper-map! :leader "do" #'denote-open-or-create
                "dd" #'denote-open-or-create
                "dt" #'denote-type
                "dn" #'denote))
#+end_src


** Dired subtree
https://github.com/Fuco1/dired-hacks
#+begin_src elisp
  (when (fboundp 'package-vc-install)
    (unless (require 'dired-subtree nil 'noerror)
      (package-vc-install '(dired-subtree :url "https://github.com/JasZhe/dired-hacks")))
    (viper-map! :mode 'dired-mode "<tab>" #'dired-subtree-toggle))
#+end_src

** coterm
#+begin_src elisp
  (use-package coterm :ensure t
    :config 
    (coterm-mode))
#+end_src

** eat
#+begin_src elisp
  (use-package eat :ensure t
    :hook
    (eat-exec . (lambda (&rest _) (eat-line-mode)))
    :config
    (setq eat-enable-auto-line-mode t)
    (viper-map! :leader "ot" #'eat))
#+end_src


* external language packages
:PROPERTIES:
:HEADER-ARGS: :tangle no
:END:
** web mode
no good replacement, just have to turn on js-mode or js-jsx-mode and html-mode
#+begin_src elisp
    (unless (require 'web-mode nil 'noerrror)
      (package-vc-install '(web-mode :url "https://github.com/fxbois/web-mode"
                                     :rev "82847071ce93293bdb7945db08d970f13fd883cf")))
    (use-package web-mode :ensure nil :pin gnu
      :mode "\\.gohtml\\'"
      :config
      (setq web-mode-engines-alist '(("go" . "\\.gohtml\\'") ("svelte" . "\\.svelte\\'"))))
#+end_src

** markdown
#+begin_src elisp :tangle no
  (use-package markdown-mode :ensure t)
#+end_src

** pdf tools
just browse pdfs with external tools
#+begin_src elisp
  (use-package pdf-tools :ensure nil :pin gnu
    :mode "\\.pdf\\'"
    :config
      (setq my/pdf-vi-state-modify-map (make-sparse-keymap))
      (define-key my/pdf-vi-state-modify-map "o" #'pdf-outline)
      (define-key my/pdf-vi-state-modify-map "H" #'pdf-view-fit-height-to-window)
      (define-key my/pdf-vi-state-modify-map "W" #'pdf-view-fit-width-to-window)
      (define-key my/pdf-vi-state-modify-map "j" #'pdf-view-next-line-or-next-page)
      (define-key my/pdf-vi-state-modify-map "k" #'pdf-view-previous-line-or-previous-page)
     (setq pdf-view-resize-factor 1.10)
      (define-key my/pdf-vi-state-modify-map "+" #'pdf-view-enlarge)
      (define-key my/pdf-vi-state-modify-map "-" #'pdf-view-shrink)

      (viper-modify-major-mode 'pdf-view-mode 'vi-state my/pdf-vi-state-modify-map)
    )
#+end_src

* attempt at evil mode setup
:PROPERTIES:
:HEADER-ARGS: :tangle no
:END:

#+begin_src elisp
  (use-package evil :ensure t
    :config
    (setq evil-want-C-u-scroll t))

  (unless (require 'evil-collection nil 'noerror)
    (package-vc-install '(evil-collection :url "https://github.com/emacs-evil/evil-collection")))
  (use-package evil-collection :after evil
    :config
    (evil-collection-init))
#+end_src

* custom
#+begin_src elisp
  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(package-selected-packages '(window-stool))
   '(package-vc-selected-packages
     '((window-stool :vc-backend Git :url "https://github.com/JasZhe/window-stool")))
   '(safe-local-variable-values
     '((eval add-hook 'after-save-hook
             (lambda nil
               (org-babel-tangle))
             nil t))))
#+end_src

* Local variables                                                        
;; Local Variables:                                                      
;; eval: (add-hook 'after-save-hook (lambda () (org-babel-tangle)) nil t)
;; End:                                                                  
